// src/utils/constants.js
export const animalTypes = {
  'кошка': 'Кошка',
  'собака': 'Собака',
  'птица': 'Птица',
  'грызун': 'Грызун',
  'другое': 'Другое'
};

export const districts = {
  '1': 'Адмиралтейский район',
  '2': 'Василеостровский район',
  '3': 'Выборгский район',
  '4': 'Калининский район',
  '5': 'Кировский район',
  '6': 'Колпинский район',
  '7': 'Красногвардейский район',
  '8': 'Красносельский район',
  '9': 'Кронштадтский район',
  '10': 'Курортный район',
  '11': 'Московский район',
  '12': 'Невский район',
  '13': 'Петроградский район',
  '14': 'Петродворцовый район',
  '15': 'Приморский район',
  '16': 'Пушкинский район',
  '17': 'Фрунзенский район',
  '18': 'Центральный район'
};

export const API_ENDPOINTS = {
  BASE: 'https://pets.сделай.site/api',
  SLIDER: '/pets/slider',
  PETS: '/pets',
  SEARCH: '/search',
  REGISTER: '/register',
  LOGIN: '/login',
  USERS: '/users',
  USER_ORDERS: '/users/orders',
  SUBSCRIPTION: '/subscription'
};